In [2]:
import numpy as np
import pandas as pd

In [3]:
labels=['a','b','c']

In [4]:
mylist=[1,2,3]

In [5]:
arr=np.array([10,11,12])

In [6]:
d={'a':10,'b':20,'c':30}

In [7]:
labels

['a', 'b', 'c']

In [8]:
mylist

[1, 2, 3]

In [9]:
arr

array([10, 11, 12])

In [10]:
d

{'a': 10, 'b': 20, 'c': 30}

In [11]:
pd.Series(data=mylist)

0    1
1    2
2    3
dtype: int64

In [12]:
pd.Series(data=labels)

0    a
1    b
2    c
dtype: object

In [13]:
pd.Series(data=mylist,index=labels)

a    1
b    2
c    3
dtype: int64

In [14]:
pd.Series(arr,labels)

a    10
b    11
c    12
dtype: int32

In [15]:
d

{'a': 10, 'b': 20, 'c': 30}

In [16]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [17]:
#DataFrame -> df

In [18]:
from numpy.random import randn

In [19]:
np.random.seed(101)

In [20]:
df=pd.DataFrame(randn(5,4),index='A,B,C,D,E'.split(','),columns = ['W','X','Y','Z'])

In [21]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [22]:
index='A,B,C,D,E'.split(',')

In [23]:
index

['A', 'B', 'C', 'D', 'E']

In [24]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [25]:
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [26]:
df1=df[['W','Y']]

In [27]:
df1

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077
C -2.018168  0.528813
D  0.188695 -0.933237
E  0.190794  2.605967

In [28]:
df1['X1']=df['X']

C:\Users\DELL\anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [29]:
df1

          W         Y        X1
A  2.706850  0.907969  0.628133
B  0.651118 -0.848077 -0.319318
C -2.018168  0.528813  0.740122
D  0.188695 -0.933237 -0.758872
E  0.190794  2.605967  1.978757

In [30]:
df1.drop('X1',axis=1,inplace=True)

C:\Users\DELL\anaconda3\lib\site-packages\pandas\core\frame.py:3997: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  errors=errors,

In [31]:
df1

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077
C -2.018168  0.528813
D  0.188695 -0.933237
E  0.190794  2.605967

In [32]:
df.drop('E',axis=0)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [33]:
df1.drop('E',axis=0)

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077
C -2.018168  0.528813
D  0.188695 -0.933237

In [34]:
#Selection of Rows

In [35]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [36]:
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [37]:
df.iloc[1]

W    0.651118
X   -0.319318
Y   -0.848077
Z    0.605965
Name: B, dtype: float64

In [38]:
df.loc[['C','D'],['Y','Z']]

          Y         Z
C  0.528813 -0.589001
D -0.933237  0.955057

In [39]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [40]:
df[df['W']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [64]:
df[(df['W']>0) & (df['X']>0)]

            W         X         Y         Z
NEW
a    2.706850  0.628133  0.907969  0.503826
e    0.190794  1.978757  2.605967  0.683509

In [65]:
df.reset_index()

  NEW         W         X         Y         Z
0   a  2.706850  0.628133  0.907969  0.503826
1   b  0.651118 -0.319318 -0.848077  0.605965
2   c -2.018168  0.740122  0.528813 -0.589001
3   d  0.188695 -0.758872 -0.933237  0.955057
4   e  0.190794  1.978757  2.605967  0.683509

In [66]:
a=['a','b','c','d','e']
df['NEW']=a

In [67]:
df

            W         X         Y         Z NEW
NEW
a    2.706850  0.628133  0.907969  0.503826   a
b    0.651118 -0.319318 -0.848077  0.605965   b
c   -2.018168  0.740122  0.528813 -0.589001   c
d    0.188695 -0.758872 -0.933237  0.955057   d
e    0.190794  1.978757  2.605967  0.683509   e

In [68]:
df.set_index('NEW',inplace=True)

In [69]:
df

            W         X         Y         Z
NEW
a    2.706850  0.628133  0.907969  0.503826
b    0.651118 -0.319318 -0.848077  0.605965
c   -2.018168  0.740122  0.528813 -0.589001
d    0.188695 -0.758872 -0.933237  0.955057
e    0.190794  1.978757  2.605967  0.683509

In [70]:
#Missing Data

In [77]:
df=pd.DataFrame({'A':[1,2, np.nan, np.nan], 'B':[2,8,np.nan,5], 'C':[1,3,5,7]})

In [78]:
df

     A    B  C
0  1.0  2.0  1
1  2.0  8.0  3
2  NaN  NaN  5
3  NaN  5.0  7

In [83]:
df.dropna(axis=1)

   C
0  1
1  3
2  5
3  7

In [80]:
df

     A    B  C
0  1.0  2.0  1
1  2.0  8.0  3
2  NaN  NaN  5
3  NaN  5.0  7

In [85]:
df.fillna(value=0)

     A    B  C
0  1.0  2.0  1
1  2.0  8.0  3
2  0.0  0.0  5
3  0.0  5.0  7

In [89]:
df.fillna(value=df['A'].mean())

     A    B  C
0  1.0  2.0  1
1  2.0  8.0  3
2  1.5  1.5  5
3  1.5  5.0  7

In [102]:
df1=pd.DataFrame({'A':['a','b','c'],'B':['d','e','f'],'C':['g','h','i']})

In [107]:
df2=pd.DataFrame({'A':['a2','b2','c2'],'B':['d2','e2','f2'],'C':['g2','h2','i2']},index=[3,4,5])

In [108]:
df1

   A  B  C
0  a  d  g
1  b  e  h
2  c  f  i

In [109]:
df2

    A   B   C
3  a2  d2  g2
4  b2  e2  h2
5  c2  f2  i2

In [110]:
pd.concat([df1,df2])

    A   B   C
0   a   d   g
1   b   e   h
2   c   f   i
3  a2  d2  g2
4  b2  e2  h2
5  c2  f2  i2

In [113]:
pd.concat([df1,df2],axis=1)

     A    B    C    A    B    C
0    a    d    g  NaN  NaN  NaN
1    b    e    h  NaN  NaN  NaN
2    c    f    i  NaN  NaN  NaN
3  NaN  NaN  NaN   a2   d2   g2
4  NaN  NaN  NaN   b2   e2   h2
5  NaN  NaN  NaN   c2   f2   i2

In [114]:
#merge

In [117]:
pd.merge(df1,df2,how='outer',on=['A','B','C'])

    A   B   C
0   a   d   g
1   b   e   h
2   c   f   i
3  a2  d2  g2
4  b2  e2  h2
5  c2  f2  i2

In [128]:
df3=pd.DataFrame({'D':['a2','b2','c2'],'E':['d2','e2','f2'],'F':['g2','h2','i2']},index=[3,4,5])

In [129]:
df2.join(df3)

    A   B   C   D   E   F
3  a2  d2  g2  a2  d2  g2
4  b2  e2  h2  b2  e2  h2
5  c2  f2  i2  c2  f2  i2

In [130]:
#Basic Operation

In [133]:
df=pd.DataFrame({'A':[1,2,3,2],'B':[11,22,33,11],'C':['aaa','bbb','ccc','dd']})

In [134]:
df

   A   B    C
0  1  11  aaa
1  2  22  bbb
2  3  33  ccc
3  2  11   dd

In [139]:
df['C'].unique()

array(['aaa', 'bbb', 'ccc', 'dd'], dtype=object)

In [140]:
df['C'].nunique()

4

In [141]:
#Conditional Selection

In [142]:
df1=df[(df['A']<3) & (df['B']<30)]

In [143]:
df1

   A   B    C
0  1  11  aaa
1  2  22  bbb
3  2  11   dd

In [144]:
df1.apply(len)

A    3
B    3
C    3
dtype: int64

In [145]:
df.sum()

A              8
B             77
C    aaabbbcccdd
dtype: object

In [146]:
del df['B']

In [147]:
df

   A    C
0  1  aaa
1  2  bbb
2  3  ccc
3  2   dd

In [149]:
df.columns

Index(['A', 'C'], dtype='object')

In [153]:
df.sort_values(by='A')

   A    C
0  1  aaa
1  2  bbb
3  2   dd
2  3  ccc

In [158]:
df.isnull()

       A      C
0  False  False
1  False  False
2  False  False
3  False  False

In [159]:
df.notnull()

      A     C
0  True  True
1  True  True
2  True  True
3  True  True

In [160]:
df=pd.DataFrame({'A':[1,2,3,2],'B':[11,22,33,11],'C':['aaa','bbb','ccc','dd']})

In [161]:
df

   A   B    C
0  1  11  aaa
1  2  22  bbb
2  3  33  ccc
3  2  11   dd

In [164]:
df.to_csv('no_index',index=False)

In [163]:
df

   A   B    C
0  1  11  aaa
1  2  22  bbb
2  3  33  ccc
3  2  11   dd

In [177]:
df1=pd.read_csv('data')

In [178]:
df1

   Unnamed: 0  A   B    C
0           0  1  11  aaa
1           1  2  22  bbb
2           2  3  33  ccc
3           3  2  11   dd

In [179]:
df2=pd.read_csv('no_index')

In [180]:
df2

   A   B    C
0  1  11  aaa
1  2  22  bbb
2  3  33  ccc
3  2  11   dd

In [184]:
df.to_excel('excel.xlsx',index=False)

In [185]:
df3=pd.read_excel('excel.xlsx')

In [186]:
df3

   A   B    C
0  1  11  aaa
1  2  22  bbb
2  3  33  ccc
3  2  11   dd